Mini - scladSRV/DataProcessors/РегламентноеТест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РегламентноеТест</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Mini - scladSRV/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количественный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Ценовой</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УчетнаяПолитика</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Mini - scladSRV/Documents/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Реализация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количественный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Ценовой</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Ценовой</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Mini - scladSRV/DataProcessors/РегламентноеТест/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура Команда1НаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Реализация.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Реализация КАК Реализация
		|ГДЕ
		|	Реализация.Проведен
		|	И Реализация.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДокументЗакрытия = РезультатЗапроса.Выбрать();
	
	Пока ДокументЗакрытия.Следующий() Цикл
		Реализация = ДокументЗакрытия.Ссылка.ПолучитьОбъект();
		Реализация.Завершен = Истина;
		Реализация.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбновитьТоварыБезДвиженияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыБезДвижения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТоварыБезДвижения КАК ТоварыБезДвижения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбновления = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаОбновления.Следующий() Цикл
		СправочникКУдалению = ВыборкаОбновления.Ссылка.ПолучитьОбъект();
		СправочникКУдалению.Удалить();
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ОстаткиТоваров.Товар КАК Справочник.Товары).Наименование КАК Наименование
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров КАК ОстаткиТоваров";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗапись = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапись.Следующий() Цикл
		НоваяЗапись = Справочники.ТоварыБезДвижения.СоздатьЭлемент();
		НоваяЗапись.Наименование = ВыборкаЗапись.Наименование;
	    НоваяЗапись.УстановитьНовыйКод();
		НоваяЗапись.Записать();
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьТоварыБезДвижения(Команда)
	ОбновитьТоварыБезДвиженияНаСервере();
КонецПроцедуры
